ann(skylake)_consolidated_4core_1iothread/multiplier_4/run4.txt
# run=4/10
# 2026-04-06T16:18:24+09:00
# cmd: taskset -c 1-15 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            353514
        write:                           92016
        other:                           47221
        total:                           492751
    transactions:                        21970  (365.84 per sec.)
    queries:                             492751 (8205.19 per sec.)
    ignored errors:                      3281   (54.63 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      365.8399
    time elapsed:                        60.0536s
    total number of events:              21970

Latency (ms):
         min:                                    2.93
         avg:                                   87.45
         max:                                 2512.09
         95th percentile:                      267.41
         sum:                              1921338.65

Threads fairness:
    events (avg/stddev):           686.5625/12.10
    execution time (avg/stddev):   60.0418/0.01